# QiuChenly 计算数据差值做特征码算法
# 部分网友提供了原始版本 虽然是用的Chatgpt写给我的 但是还是略表谢意
# 提供不定长度的多个十六进制汇编代码段 自动求出差值特征码

data = """
55 48 89 E5 53 50 48 89 FB 48 8D 35 B4 65 1C 00 E8 4B C1 18 00 85 C0 0F 84 96 00 00 00 48 8D 35 B0 65 1C 00 48 89 DF E8 34 C1 18 00 85 C0 0F 84 86 00 00 00 48 8D 35 AD 65 1C 00 48 89 DF E8 1D C1 18 00 85 C0 74 7A 48 8D 35 A9 65 1C 00 48 89 DF E8 0A C1 18 00 85 C0 74 6E 48 8D 35 AC 65 1C 00 48 89 DF E8 F7 C0 18 00 85 C0 74 62 48 8D 35 AB 65 1C 00 48 89 DF E8 E4 C0 18 00 85 C0 74 53 48 8D 35 B3 65 1C 00 48 89 DF E8 D1 C0 18 00 85 C0 74 47 48 8D 35 AF 65 1C 00 48 89 DF E8 BE C0 18 00 85 C0 B9 98 01 00 00 B8 0A 00 00 00 0F 44 C1 EB 2C B8 92 01 00 00 EB 25 B8 93 01 00 00 EB 1E B8 94 01 00 00 EB 17 B8 95 01 00 00 EB 10 31 C0 EB 0C B8 96 01 00 00 EB 05 B8 97 01 00 00 48 83 C4 08 5B 5D C3 55 48 89 E5 48 8B BF 00 01 00 00 E8 F8 C5 F6 FF 48 89 C7 5D E9 01 FF FF FF 90 55 48 89 E5 41 57 41 56 41 55

55 48 89 E5 53 50 48 89 FB 48 8D 35 35 68 1B 00 E8 2F 83 17 00 85 C0 0F 84 96 00 00 00 48 8D 35 31 68 1B 00 48 89 DF E8 18 83 17 00 85 C0 0F 84 86 00 00 00 48 8D 35 2E 68 1B 00 48 89 DF E8 01 83 17 00 85 C0 74 7A 48 8D 35 2A 68 1B 00 48 89 DF E8 EE 82 17 00 85 C0 74 6E 48 8D 35 2D 68 1B 00 48 89 DF E8 DB 82 17 00 85 C0 74 62 48 8D 35 2C 68 1B 00 48 89 DF E8 C8 82 17 00 85 C0 74 53 48 8D 35 34 68 1B 00 48 89 DF E8 B5 82 17 00 85 C0 74 47 48 8D 35 30 68 1B 00 48 89 DF E8
"""

data1 = []

for i in data.split("\n"):
    if i == "":
        continue
    else:
        data1.append(i)
        if len(data1) > 1:
            res = " ".join(
                [
                    d1 if d1 == d2 else "??"
                    for d1, d2 in zip(data1[0].split(), data1[1].split())
                ]
            )
            data1 = [res]

print(data1[0])
